[
  {
  "job_role": "Careers at Ahluwalia Contracts (India) Ltd.",
  "job_id": "ACIL-Career-001",
  "Experience": "Freshers and experienced professionals in construction industry",
  "job_type": "Full time",
  "Expected_CTC": "4-15 LPA",
  "work_mode": "Onsite",
  "Eligible": "Graduate / Postgraduate / Engineering Diploma / B.Tech / B.E in Civil Engineering, Architecture, or relevant construction fields",
  "location": "New Delhi (Head Office) and multiple project sites across India",
  "job_summary": "Ahluwalia Contracts (India) Ltd. offers career opportunities for bright, talented, and highly energized individuals interested in excelling in the construction industry. The company provides exposure to prestigious projects, cutting-edge technologies, and high-quality construction practices.",
  "role_detailes": [
    "Opportunity to work on landmark and prestigious projects across diverse sectors.",
    "Gain experience in modern construction technologies, design, and innovative applications.",
    "Collaborate with cross-functional teams for effective and timely project execution.",
    "Ensure adherence to quality standards, safety norms, and client satisfaction.",
    "Develop leadership, technical, and project management skills within a dynamic work environment.",
    "Contribute to the creation of iconic infrastructure and sustainable development.",
    "Continuous learning and growth opportunities through challenging assignments."
  ],
  "Note": "Ahluwalia Contracts (India) Ltd. does not charge any recruitment fees. Candidates should beware of fraudulent job offers.",
  "mandatory": "Relevant degree/diploma in construction, civil, or architectural fields",
  "skills_expected": [
    "Construction Project Management",
    "Design and Structural Knowledge",
    "Quality and Safety Compliance",
    "Client and Stakeholder Coordination",
    "Team Collaboration and Leadership",
    "Application of New Construction Technologies",
    "Resource and Time Management",
    "Problem-Solving in Dynamic Environments"
  ],
  "skills": [
    "Civil Engineering",
    "Architecture",
    "Project Execution",
    "Quality Control",
    "Safety Auditing",
    "Technical Design Review",
    "Client Relationship Management",
    "Construction Technology Application",
    "Team Management",
    "Sustainable Development Practices"
  ],
  "job_discription_url": "/services/Jobs/company jobs/primary/primary_job.html",
  "apply_link": "https://rssbeta.mysita.com/register"
}

  
]