[
  {
  "job_role": "Pharmacy Trainee",
  "job_id": "Not specified",
  "Experience": "0-1 years (Freshers eligible)",
  "job_type": "Full time",
  "Expected_CTC": "1.8 - 2.6 LPA",
  "work_mode": "Onsite (Bengaluru)",
  "Eligible": "SSC / Intermediate / Degree holders (Freshers or candidates without prior pharmacy retail experience)",
  "location": "Bengaluru, Karnataka, India",
  "job_summary": "The Pharmacy Trainee at Apollo Pharmacy assists licensed pharmacists in dispensing prescribed medicines, ensuring inventory accuracy, maintaining cold chain conditions, handling billing and customer interactions, and supporting daily operational activities to maintain compliance and efficiency in the pharmacy store.",
  "role_detailes": [
    "Assist the pharmacist in dispensing drugs as per doctor's prescription and ensure accuracy of medicine issued.",
    "Arrange unavailable medicines from other Apollo in-house pharmacies or consult with doctors for substitution.",
    "Cross-check bills against issued medicines for patient details, quantity, name, and expiry.",
    "Manage pharmacy stock and raise indents based on availability and demand.",
    "Counsel customers on drug usage, side effects, and health maintenance guidance.",
    "Maintain patient relations through consistent communication with doctors and customers.",
    "Update and monitor free home delivery register, ensuring timely medicine deliveries.",
    "Handle inbound calls related to medicine information, home delivery orders, and therapy guidance.",
    "Handle cash counters and billing operations as required.",
    "Ensure proper cold chain storage and monitor drug security parameters.",
    "Verify received stock details such as MRP, batch, expiry, and entry in inventory systems.",
    "Record and manage stock transfers between branches or collection from distribution centers during emergencies.",
    "Maintain a no-stock record and regularly follow up to replenish items.",
    "Conduct physical stock verification by category (tablets, syrups, injections, etc.) twice weekly.",
    "Perform rack-wise daily verification of fast-moving items and handover updates during shift changes.",
    "Ensure the pharmacy meets daily sales targets and maintains a high standard of service.",
    "Undertake any additional work assigned by the in-charge as required by pharmacy operations."
  ],
  "Note": "This job offers competitive salary, benefits, and performance-based incentives. Fresh graduates with strong communication skills and basic medicine knowledge are encouraged to apply.",
  "mandatory": "Basic qualification (SSC, Inter, or Degree) with interest in pharmacy operations and customer service.",
  "skills_expected": [
    "Knowledge of drugs and medicines",
    "Customer interaction and counselling",
    "Inventory and stock management",
    "Sales target orientation",
    "Communication and interpersonal skills",
    "Cash handling and billing process",
    "Cold chain drug management",
    "Attention to detail",
    "Record keeping",
    "Computer literacy for billing and inventory"
  ],
  "skills": [
    "Pharmacy Operations",
    "Customer Service",
    "Medicine Dispensing",
    "Inventory Control",
    "Cold Chain Management",
    "Sales Tracking",
    "Billing and Cash Handling",
    "Team Collaboration",
    "Stock Auditing",
    "Health Counselling"
  ],
  "job_discription_url": "/services/Jobs/company jobs/primary/primary_job.html",
  "apply_link": "https://careers.apollopharmacy.app/job-description/MjA2Njc%3D/MjI1"
},
{
  "job_role": "Product Advisor",
  "job_id": "Not specified",
  "Experience": "0-3 years",
  "job_type": "Full time",
  "Expected_CTC": "2.2 - 3.2 LPA",
  "work_mode": "Onsite (Bengaluru)",
  "Eligible": "10+2 / Any Graduate (Science preferred) with interest in nutrition, pharma, or retail sales",
  "location": "Bengaluru, Karnataka, India",
  "job_summary": "The Product Advisor at Apollo Pharmacy is responsible for promoting nutrition and health supplement products, assisting customers with product recommendations, maintaining store displays, handling billing, and ensuring a superior customer service experience in a retail pharmacy environment.",
  "role_detailes": [
    "Promote nutrition and health supplement products actively to increase customer awareness and sales.",
    "Greet customers warmly upon entry to create a positive shopping atmosphere.",
    "Assist customers in selecting suitable products based on their health needs and preferences.",
    "Provide nutritional guidance and explain product benefits, usage, and value.",
    "Maintain cleanliness and organization of the shop floor and shelves at all times.",
    "Replenish stocks and display products effectively to maximize visibility and sales potential.",
    "Handle customer billing, process cash and credit card payments accurately, and issue receipts.",
    "Maintain up-to-date knowledge of current promotions, discounts, and security policies.",
    "Identify and report potential theft, inventory loss, or shoplifting incidents.",
    "Assist with opening and closing of cash registers and balancing daily sales records.",
    "Support store team members in meeting monthly sales targets and maintaining customer satisfaction.",
    "Engage with customers to explain samples or demo products where applicable.",
    "Ensure compliance with all store operating procedures and policies."
  ],
  "Note": "This role offers competitive salary, benefits, and incentive-based rewards. Suitable for candidates who are confident, energetic, and enthusiastic about health and nutrition sales.",
  "mandatory": "Minimum qualification of 10+2 with good sales and communication skills. Science graduates with retail or nutrition sales experience preferred.",
  "skills_expected": [
    "Retail Sales",
    "Customer Service",
    "Product Promotion",
    "Communication Skills",
    "Nutritional Knowledge",
    "Presentation and Grooming",
    "Point of Sale (POS) Handling",
    "Inventory Management",
    "Team Coordination",
    "Complaint Resolution"
  ],
  "skills": [
    "Sales Techniques",
    "Customer Relationship Management",
    "Health Supplement Advisory",
    "Active Listening",
    "Cash Handling",
    "Merchandising and Display Management",
    "Cross-Selling and Upselling",
    "Store Maintenance",
    "Record Keeping",
    "Time Management"
  ],
  "job_discription_url": "/services/Jobs/company jobs/primary/primary_job.html",
  "apply_link": "https://careers.apollopharmacy.app/job-description/MjA2Njg%3D/MjI1"
}
  
]