[
  {
  "job_role": "User Experience Research Intern, MS, Summer 2026",
  "job_id": "Google-UXR-Intern-2026",
  "Experience": "Internship, work, or project experience with research design utilizing various methods such as usability studies, contextual inquiry, and surveys.",
  "job_type": "Internship",
  "Expected_CTC": "Equivalent to an annualized salary range of $86,000 - $115,000 USD (approx. ₹71–95 LPA, prorated for internship duration)",
  "work_mode": "Onsite",
  "Eligible": "Students currently pursuing a Master's degree in Human Factors, Psychology, Human Computer Interaction, Cognitive Science, Computer Science, Information Science, or related field; penultimate year students.",
  "location": "Mountain View, CA, USA; +29 locations across the US including New York, Seattle, Austin, Atlanta, Los Angeles, and more",
  "job_summary": "Work within Google’s multi-disciplinary UX team to conduct user research and help design user-centered products. The intern will collaborate with designers, engineers, and product managers to understand user behavior, identify improvement areas, and advocate for data-driven design decisions.",
  "role_detailes": [
    "Design and conduct independent qualitative and quantitative research studies.",
    "Work cross-functionally with design, engineering, and product teams to inform user-centric decisions.",
    "Collect and analyze user data using lab studies, field visits, ethnography, surveys, and A/B testing.",
    "Communicate and advocate research findings across teams to improve product usability and effectiveness.",
    "Integrate insights into design practices and contribute to product development strategy."
  ],
  "Note": "Application deadline: October 31, 2025. Apply early as applications are reviewed on a rolling basis. Candidates must be physically located in the US during the internship.",
  "mandatory": "Must be enrolled in a Master’s program in a relevant field; must be in penultimate academic year and eligible to work full-time in the US for 12 weeks.",
  "skills_expected": [
    "User Research Methodologies",
    "Usability Study Design",
    "Data Analysis and Interpretation",
    "Experimental Design and Statistics",
    "Cross-functional Collaboration",
    "Effective Communication and Presentation",
    "Human-Computer Interaction Principles",
    "Product Design Integration"
  ],
  "skills": [
    "Qualitative and Quantitative Research",
    "Survey Design",
    "Ethnographic Fieldwork",
    "A/B Testing and Benchmarking",
    "Statistical Analysis",
    "UX Design Thinking",
    "Behavioral Data Evaluation",
    "User-Centered Product Development",
    "Interpersonal and Negotiation Skills",
    "Research Communication"
  ],
  "job_discription_url": "/services/Jobs/company jobs/primary/primary_job.html",
  "apply_link": "https://www.google.com/about/careers/applications/jobs/results/83211820956820166-user-experience-research-intern-ms-summer-2026?company=Fitbit&company=Google&company=YouTube&distance=50&employment_type=INTERN"
}

]