[
  {
  "job_role": "Manager - Promo Edit",
  "job_id": "",
  "Experience": "3-6 yr",
  "job_type": "Full time",
  "Expected_CTC": "",
  "work_mode": "Onsite (100% Work from Office)",
  "Eligible": "Graduation with 3–6 years of experience in Promo Editing (Media or Non-Media background)",
  "location": "Bangalore (M G Road)",
  "job_summary": "Responsible for understanding creative briefs from the OAP team to edit and produce high-quality channel promos. The role involves driving innovation, ideation, execution excellence, and stakeholder management to deliver impactful promotional content aligned with business goals.",
  "Note": "Role requires balancing innovation and efficiency while adhering to broadcast parameters and channel standards.",
  "mandatory": "Proficiency in Adobe Premiere Pro and 3–6 years of promo editing experience.",
  "skills_expected": [
    "Understand briefs from the OAP team for channel promos and execute accordingly.",
    "Enhance promo creatives with innovative ideas, scripting, and proper execution.",
    "Deliver high-quality edits conforming to channel audio and video standards.",
    "Maintain balance between quality and quantity while ensuring productivity benchmarks are met.",
    "Ensure zero disruption on air with adherence to QC/TC standards.",
    "Demonstrate proficiency in Adobe Premiere Pro and basic knowledge of After Effects, Photoshop, Flame, and ProTools.",
    "Deliver creative scripts and promo ideas regularly, with at least 2 new concepts each month.",
    "Engage and collaborate effectively with internal stakeholders – Programming, OAP, Digital Archiving, TC & Capsuling.",
    "Contribute to automation processes, implement improvements, and participate in new creative processes.",
    "Work closely with internal and external teams in a high-paced creative environment."
  ],
  "skills": [
    "Adobe Premiere Pro expertise",
    "After Effects (basic)",
    "Photoshop (basic)",
    "Flame (basic)",
    "ProTools (basic)",
    "Creative ideation",
    "Script writing",
    "Video and audio editing",
    "Stakeholder collaboration",
    "Broadcast parameters knowledge"
  ],
  "job_discription_url": "/services/Jobs/company jobs/primary/primary_job.html",
  "apply_link": ""
}

]